noless-zz/esp8266-led-strip-clock/src/main.cpp
  for (int i = -2; i <= 2; i++) {
    uint8_t level = (i == 0) ? 255 : ((abs(i) == 1) ? 170 : 90);
    addPixelWrap(hourPos + i, level, 30, 30);
  }

  for (int i = -1; i <= 1; i++) {
    uint8_t level = (i == 0) ? 255 : 120;
    addPixelWrap(minutePos + i, 30, level, 30);
  }

  for (int i = 0; i < secTrailLen; i++) {
    uint8_t level = 255 - (i * 210 / secTrailLen);
    addPixelWrap(secondPos - i, 30, 60, level);
  }
}

void displayMode_Simple() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;

  memset(leds, 0, sizeof(leds));
  
  int hourPos = (hour12 * 5 + minute / 12) % NUM_LEDS;
  int minutePos = minute % NUM_LEDS;
  int secondPos = second % NUM_LEDS;
  
  // Red hour marker (3 LEDs)
  for (int i = -1; i <= 1; i++) {
    int idx = (hourPos + i + NUM_LEDS) % NUM_LEDS;
    leds[idx] = {255, 0, 0};
  }
  
  // Green minute marker (3 LEDs)
  for (int i = -1; i <= 1; i++) {
    int idx = (minutePos + i + NUM_LEDS) % NUM_LEDS;
    leds[idx] = {0, 255, 0};
  }
  
  // Blue second marker (3 LEDs)
  for (int i = -1; i <= 1; i++) {
    int idx = (secondPos + i + NUM_LEDS) % NUM_LEDS;
    leds[idx] = {0, 0, 255};
  }
  
  applyBrightnessAndShow();
}

void displayMode_Pulse() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;

  memset(leds, 0, sizeof(leds));
  uint32_t ms = millis();
  uint8_t beat = (uint8_t)((ms % 1000) < 500 ? ((ms % 500) * 80 / 500) : ((1000 - (ms % 1000)) * 80 / 500));

  // Very dim background pulse (reduced from previous)
  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t base = 5 + beat / 8;
    leds[i] = {base / 4, base / 3, base / 2};
  }

  // Clear HMS markers with more contrast
  overlayTimeMarkers(hour12, minute, second, 7);
  applyBrightnessAndShow();
}

void displayMode_Pastel() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;

  memset(leds, 0, sizeof(leds));
  
  int hourPos = (hour12 * 5 + minute / 12) % NUM_LEDS;
  int minutePos = minute % NUM_LEDS;
  int secondPos = second % NUM_LEDS;
  
  // Soft pastel hour (pink)
  for (int i = -1; i <= 1; i++) {
    uint8_t brightness = (i == 0) ? 180 : 100;
    addPixelWrap(hourPos + i, brightness, brightness / 3, brightness / 2);
  }
  
  // Soft pastel minute (mint green)
  for (int i = -1; i <= 1; i++) {
    uint8_t brightness = (i == 0) ? 160 : 90;
    addPixelWrap(minutePos + i, brightness / 4, brightness, brightness / 2);
  }
  
  // Soft pastel second (sky blue)
  for (int i = -1; i <= 1; i++) {
    uint8_t brightness = (i == 0) ? 180 : 100;
    addPixelWrap(secondPos + i, brightness / 4, brightness / 2, brightness);
  }
  
  applyBrightnessAndShow();
}

void displayMode_Binary() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;

  memset(leds, 0, sizeof(leds));

  uint8_t bits[20];
  for (int i = 0; i < 20; i++) bits[i] = 0;

  for (int i = 0; i < 6; i++) bits[i] = (hour24 >> i) & 1;
  bits[6] = 2;
  for (int i = 0; i < 6; i++) bits[7 + i] = (minute >> i) & 1;
  bits[13] = 2;
  for (int i = 0; i < 6; i++) bits[14 + i] = (second >> i) & 1;

  for (int slot = 0; slot < 20; slot++) {
    for (int j = 0; j < 3; j++) {
      int idx = slot * 3 + j;
      if (bits[slot] == 2) {
        leds[idx] = {15, 15, 15};
      } else if (slot < 7) {
        leds[idx] = bits[slot] ? CRGB{220, 60, 60} : CRGB{20, 6, 6};
      } else if (slot < 14) {
        leds[idx] = bits[slot] ? CRGB{60, 220, 60} : CRGB{6, 20, 6};
      } else {
        leds[idx] = bits[slot] ? CRGB{60, 120, 255} : CRGB{6, 10, 20};
      }
    }
  }

  applyBrightnessAndShow();
}

void displayMode_HourMarker() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;

  memset(leds, 0, sizeof(leds));

  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t base = (i <= minute) ? 40 : 12;
    leds[i] = {base / 4, base, base / 2};
  }

  overlayTimeMarkers(hour12, minute, second, 9);
  applyBrightnessAndShow();
}

void displayMode_Neon() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;

  memset(leds, 0, sizeof(leds));
  
  int hourPos = (hour12 * 5 + minute / 12) % NUM_LEDS;
  int minutePos = minute % NUM_LEDS;
  int secondPos = second % NUM_LEDS;
  
  // Bright neon magenta hour
  for (int i = -1; i <= 1; i++) {
    uint8_t brightness = (i == 0) ? 255 : 160;
    addPixelWrap(hourPos + i, brightness, 0, brightness);
  }
  
  // Bright neon cyan minute
  for (int i = -1; i <= 1; i++) {
    uint8_t brightness = (i == 0) ? 255 : 160;
    addPixelWrap(minutePos + i, 0, brightness, brightness);
  }
  
  // Bright neon yellow second
  for (int i = -1; i <= 1; i++) {
    uint8_t brightness = (i == 0) ? 255 : 160;
    addPixelWrap(secondPos + i, brightness, brightness, 0);
  }
  
  applyBrightnessAndShow();
}

void displayMode_Comet() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;

  memset(leds, 0, sizeof(leds));
  
  int hourPos = (hour12 * 5 + minute / 12) % NUM_LEDS;
  int minutePos = minute % NUM_LEDS;
  int secondPos = second % NUM_LEDS;
  
  // Hour comet trail (red, 7 LEDs long)
  for (int i = 0; i < 7; i++) {
    uint8_t fade = 255 - (i * 35);
    addPixelWrap(hourPos - i, fade, 0, 0);
  }
  
  // Minute comet trail (green, 5 LEDs long)
  for (int i = 0; i < 5; i++) {
    uint8_t fade = 255 - (i * 50);
    addPixelWrap(minutePos - i, 0, fade, 0);
  }
  
  // Second comet trail (blue, 10 LEDs long with faster fade)
  for (int i = 0; i < 10; i++) {
    uint8_t fade = 255 - (i * 25);
    addPixelWrap(secondPos - i, 0, 0, fade);
  }
  
  applyBrightnessAndShow();
}

void displayMode_Flame() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;

  // Optimize: update flame only every 50ms (20 times/sec instead of 60)
  static uint32_t lastUpdate = 0;
  uint32_t now = millis();
  
  if (now - lastUpdate > 50) {  // Update max 20 times/sec instead of 60
    lastUpdate = now;
    uint32_t phase = now / 40;  // Slower phase calculation
    
    for (int i = 0; i < NUM_LEDS; i++) {
      // Simplified pseudo-random without heavy multiplication
      uint32_t x = (uint32_t)(i * 41 + phase * 7);
      uint8_t flicker = (uint8_t)((x ^ (x >> 4)) & 0x3F);  // Reduced bit ops
      uint8_t r = 80 + flicker;
      uint8_t g = 15 + flicker / 3;
      uint8_t b = 2;
      leds[i] = {r, g, b};
    }
  }

  overlayTimeMarkers(hour12, minute, second, 9);
  applyBrightnessAndShow();
}

void displayClock() {
  // Dispatcher: choose display mode
  switch (displayMode) {
    case DISPLAY_SIMPLE:
      displayMode_Simple();
      break;
    case DISPLAY_PULSE:
      displayMode_Pulse();
      break;
    case DISPLAY_BINARY:
      displayMode_Binary();
      break;
    case DISPLAY_HOUR_MARKER:
      displayMode_HourMarker();
      break;
    case DISPLAY_FLAME:
      displayMode_Flame();
      break;
    case DISPLAY_PASTEL:
      displayMode_Pastel();
      break;
    case DISPLAY_NEON:
      displayMode_Neon();
      break;
    case DISPLAY_COMET:
      displayMode_Comet();
      break;
    case DISPLAY_SOLID:
    default:
      displayClock_Solid();
      break;
  }
}

void displayClock_Solid() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;

  memset(leds, 0, sizeof(leds));
  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t r, g, b;
    hsvToRgb((i * 6 + second * 6) % 360, 180, 30, r, g, b);
    leds[i] = {r, g, b};
  }

  overlayTimeMarkers(hour12, minute, second, 9);
  applyBrightnessAndShow();
}

// ============================================================================
// EEPROM Functions
// ============================================================================

void loadEEPROMSettings() {
  EEPROM.begin(EEPROM_SIZE);
  uint8_t magic = EEPROM.read(EEPROM_MAGIC_ADDR);
  if (magic != EEPROM_MAGIC) {
    EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
    EEPROM.commit();
    Serial.println("[EEPROM] Initialized new settings");
    return;
  }
  
  // Load WiFi SSID
  String ssid = "";
  for (int i = 0; i < MAX_SSID_LEN; i++) {
    char c = EEPROM.read(EEPROM_SSID_ADDR + i);
    if (c == 0) break;
    ssid += c;
  }
  if (ssid.length() > 0) {
    String pass = "";
    for (int i = 0; i < MAX_PASS_LEN; i++) {
      char c = EEPROM.read(EEPROM_PASS_ADDR + i);
      if (c == 0) break;
      pass += c;
    }
    Serial.println("[EEPROM] Loaded WiFi: " + ssid);
    WiFi.begin(ssid.c_str(), pass.c_str());
  }
  
  // Load brightness
  uint8_t br = EEPROM.read(EEPROM_BRIGHTNESS_ADDR);
  if (br > 0 && br <= 255) ledBrightness = br;
  
  // Load timezone offset
  int32_t tzOff = (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 0) << 24) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 1) << 16) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 2) << 8) |
                  (EEPROM.read(EEPROM_TZ_OFFSET_ADDR + 3));
  if (tzOff != 0 && tzOff >= -43200 && tzOff <= 43200) tz.utcOffset = tzOff;
  
  // Load display mode
  uint8_t mode = EEPROM.read(EEPROM_DISPLAY_MODE_ADDR);
  if (mode < DISPLAY_MAX) displayMode = (DisplayMode)mode;
}

